[
    {
        "style": "D",
        "question": "I thrive in fast-paced environments where I can take charge and make decisions quickly.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I genuinely enjoy collaborating with others and building strong relationships within a team.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "C",
        "question": "I find great satisfaction in meticulous planning and ensuring every detail is accounted for.",
        "mapping": {
            "D": 0,
            "I": 0,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "S",
        "question": "I prioritize maintaining harmony and believe in finding common ground to resolve conflicts peacefully.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "D",
        "question": "I naturally gravitate towards leadership roles and feel comfortable taking initiative in group settings.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I have a knack for inspiring others and enjoy sharing my enthusiasm to get people excited about my ideas.",
        "mapping": {
            "D": 1,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I appreciate the comfort of routines and prefer a predictable structure to my day-to-day activities.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "I am highly detail-oriented and take pride in producing work that is precise and accurate.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I feel most at ease when I have a clear understanding of my responsibilities and can maintain control over my tasks.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I enjoy being the life of the party and easily connect with others in social situations.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I value stability and prefer environments that are calm and predictable.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "I am comfortable analyzing data and using logic to solve complex problems.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I am energized by challenges and enjoy thinking on my feet in high-pressure situations.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I am a people person and find it easy to build rapport with individuals from all walks of life.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "S",
        "question": "I tend to be cautious and prefer to carefully weigh my options before taking any risks.",
        "mapping": {
            "D": -2,
            "I": -1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "I have high standards for myself and others and strive for excellence in everything I do.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I value honesty and directness in communication, even if it means having difficult conversations.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "S",
        "question": "I believe in the power of collaboration and prefer working in teams where everyone's voice is heard.",
        "mapping": {
            "D": 0,
            "I": 1,
            "S": 2,
            "C": 0
        }
    },
    {
        "style": "C",
        "question": "I enjoy digging into complex information and finding patterns or insights that others might miss.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 0,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I am constantly seeking new opportunities to learn and grow, both personally and professionally.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "S",
        "question": "I strive to maintain positive relationships and avoid unnecessary conflict whenever possible.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "I take pride in my ability to create well-structured plans and execute them flawlessly.",
        "mapping": {
            "D": 0,
            "I": 0,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I am willing to make tough decisions and stand my ground, even if it means facing opposition or disagreement.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 1
        }
    },
    {
        "style": "I",
        "question": "I love sharing my passion with others and can easily get people excited about my ideas.",
        "mapping": {
            "D": 1,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I take pride in being dependable and consistent in everything I do.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "I double-check my work meticulously to ensure accuracy and avoid mistakes.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I thrive in environments that allow me to make quick decisions and move forward without unnecessary deliberation.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "I feel confident taking charge in situations where others may hesitate or feel uncertain.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "I enjoy setting bold goals and pushing myself to achieve them, even when the odds are against me.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I often find myself motivating others with my enthusiasm and positive attitude.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I feel energized when I am surrounded by people and enjoy interacting with them regularly.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I tend to avoid confrontation and prefer resolving disagreements through understanding and compromise.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I find satisfaction in maintaining long-term relationships and helping others feel comfortable.",
        "mapping": {
            "D": -1,
            "I": 1,
            "S": 2,
            "C": 0
        }
    },
    {
        "style": "C",
        "question": "I enjoy working in structured environments where tasks are well-defined and expectations are clear.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I am very methodical in my approach and ensure that every step of a process is followed precisely.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I prefer to make decisions quickly and decisively rather than overthinking every detail.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I get excited by the idea of meeting new people and forming connections with those around me.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I prefer a calm and steady environment, where sudden changes are rare and things go as planned.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "I tend to focus on the accuracy of details and always double-check my work for mistakes.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I thrive in competitive environments and enjoy striving to be the best at what I do.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I prefer taking a supportive role, helping others achieve their goals rather than being in the spotlight myself.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I often enjoy telling stories or experiences to entertain or inspire those around me.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "C",
        "question": "I am driven by the need for consistency and accuracy, and I dislike when things are left incomplete or messy.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I do not enjoy situations where I have to wait for others to make decisions.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I do not enjoy spending long periods of time working alone without any interaction with others.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I do not enjoy environments that are constantly changing and unpredictable.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "I do not enjoy making decisions based on incomplete information or guesswork.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I do not enjoy being in situations where I have little to no control over the outcome.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I do not enjoy working in isolation without any feedback or recognition from others.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I do not enjoy situations that involve conflict or disagreement.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "I do not enjoy tackling tasks that require creativity over precision and accuracy.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I do not enjoy following directions from others without being able to give input or suggestions.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I do not enjoy routine tasks that do not involve interacting with others.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I do not enjoy working in fast-paced environments with constant pressure.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "I do not enjoy situations where the rules are unclear or frequently change.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I do not enjoy situations where I am not the one leading the effort or making decisions.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I do not enjoy working in environments where I am not able to socialize and collaborate.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I do not enjoy being forced to make decisions quickly without enough time to think things through.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "I do not enjoy working in environments where there is little emphasis on accuracy or attention to detail.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "I",
        "question": "I enjoy participating in group activities where I can connect with a wide variety of people.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I find it easy to motivate and energize others in team settings.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I am comfortable speaking in front of large audiences and enjoy sharing my ideas.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I thrive in environments where I can interact with others regularly and build rapport.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I prefer brainstorming sessions where I can collaborate on ideas with others.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I find fulfillment in helping others see the big picture and inspire them toward a common goal.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I am skilled at building consensus among diverse groups.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I enjoy taking the lead in social gatherings and fostering a sense of community.",
        "mapping": {
            "D": 1,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I am known for being persuasive and can easily influence others to support my ideas.",
        "mapping": {
            "D": 1,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I thrive in environments where creativity and collaboration are encouraged.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I often take initiative to reach out to others and establish connections.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I enjoy celebrating the achievements of others and fostering a positive team culture.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I am energized by working on projects that allow me to collaborate with multiple departments or teams.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "I excel at networking and enjoy building long-term professional relationships.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "I am motivated by recognition from others and enjoy receiving feedback on my contributions.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "C",
        "question": "I enjoy developing detailed plans and following them precisely to achieve my goals.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I take pride in my ability to maintain high standards of accuracy and quality in my work.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I prefer environments where tasks are clearly defined, and there is a structured way to complete them.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I am meticulous about ensuring all details are correct before moving forward with a task.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I am comfortable analyzing complex data and ensuring everything is accounted for before making a decision.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I thrive in roles where attention to detail and accuracy are critical.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I am highly organized and prefer to plan my tasks in advance to ensure efficiency.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I value precision and dislike situations where there is ambiguity or uncertainty.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I prefer to work in environments where there are clear rules and guidelines that everyone follows.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I enjoy projects where I can methodically follow steps to ensure everything is done correctly.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I often double-check my work to ensure there are no mistakes before submission.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I am driven by the need to create well-organized, structured processes that others can follow.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I am motivated by the desire to produce error-free work and meet high expectations.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I feel most comfortable when I have clear, defined responsibilities and can focus on the details.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "I dislike situations where there is little control over quality and accuracy.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "I thrive when I can take charge of situations and direct others toward achieving goals.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "I prefer to set ambitious goals and push myself and others to reach them.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "I enjoy making decisions quickly and don't hesitate to act when opportunities arise.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "I am comfortable taking risks if it means achieving a bigger reward.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "I am not afraid to challenge the status quo if it means driving progress.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "I feel confident in my ability to lead teams and make difficult decisions.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "I prefer fast-paced environments where I can make significant impacts quickly.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "I enjoy working in environments where I am the one responsible for the outcomes.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "I thrive on competition and am driven to outperform others.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "I am comfortable holding others accountable for their performance to meet high standards.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "I enjoy taking on difficult challenges that test my skills and resilience.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "I prefer to lead projects rather than follow instructions from others.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "I am willing to take unpopular decisions if it leads to long-term success.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "I enjoy situations where I can demonstrate my expertise and take charge.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "I am energized by opportunities that allow me to exercise authority and influence.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "I thrive in environments where tasks and expectations are clearly defined and rarely change.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I feel most comfortable when I can follow a consistent routine and avoid unexpected changes.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I prefer working in a structured environment where there are clear processes and minimal disruptions.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I value long-term relationships and enjoy working with the same team over extended periods.",
        "mapping": {
            "D": -1,
            "I": 1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I am at my best when I can focus on one task at a time, without frequent interruptions.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I prefer predictable workflows where I know what to expect each day.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I feel most productive in environments where stability and reliability are prioritized over rapid change.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I am more comfortable with incremental improvements rather than sudden, large-scale changes.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I value a calm, steady approach to problem-solving rather than rushing into quick fixes.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I prefer long-term projects that allow me to work methodically toward a defined goal.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I enjoy environments where change is carefully planned and managed rather than happening unexpectedly.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I feel more secure when I know the exact outcomes or consequences of my actions.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I appreciate environments where stability is prioritized and sudden changes are kept to a minimum.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I am comfortable when I can rely on established processes and know that things will follow a predictable pattern.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "I prefer to work in environments where sudden changes or uncertainties are rare and decisions are well-considered.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    }
]